Revit.Application.Document.UnitTypeBySpecType(Revit.Elements.ForgeType)
Provide the Unit type from the associated with the SpecType in the Revit Document.
specType:
Returns:

Revit.Application.Document.GetLinkInstances
Retrieves all link instances in the current Revit document
document: Document
List of link instances in the document